#include "uart.h"

void Uart1_Init(void)	//9600bps@12.000MHz
{
	SCON = 0x50;		//8λ����,�ɱ䲨����
	AUXR |= 0x40;		//��ʱ��ʱ��1Tģʽ
	AUXR &= 0xFE;		//����1ѡ��ʱ��1Ϊ�����ʷ�����
	TMOD &= 0x0F;		//���ö�ʱ��ģʽ
	TL1 = 0xC7;			//���ö�ʱ��ʼֵ
	TH1 = 0xFE;			//���ö�ʱ��ʼֵ
	ET1 = 0;			//��ֹ��ʱ���ж�
	TR1 = 1;			//��ʱ��1��ʼ��ʱ
    ES = 1;                     //ʹ�ܴ����ж�
    EA = 1;	
}

bit busy;
u8 rx_buf[RXBUF];
u8 cnt_rx;
bit rx_flag=0;
u8 rx_time=0;
/*----------------------------
UART �жϷ������
-----------------------------*/
void Uart() interrupt 4
{
    if (RI)
    {
        RI = 0;                 //���RIλ
		rx_time=0;
		rx_buf[cnt_rx++]=SBUF;
		if(rx_buf[cnt_rx-1]==')'||rx_buf[cnt_rx-1]=='?'||rx_buf[cnt_rx-1]=='#') 
		{
			cnt_rx=0;
			rx_flag=1;
		}
    }
    if (TI)
    {
        TI = 0;                 //���TIλ
        busy = 0;               //��æ��־
    }
}

void vRX_time_Proc()
{
	rx_time++;
	if(rx_time>=50)
	{
		rx_time=0;
		cnt_rx=0;
		memset(rx_buf,'\0',sizeof(rx_buf));
	}
}

/*----------------------------
���ʹ�������
----------------------------*/
void SendData(u8 dat)
{
    while (busy);               //�ȴ�ǰ������ݷ������
    busy = 1;
    SBUF = dat;                 //д���ݵ�UART���ݼĴ���
}

/*----------------------------
�����ַ���
----------------------------*/
void SendString(char *s)
{
    while (*s)                  //����ַ���������־
    {
        SendData(*s++);         //���͵�ǰ�ַ�
    }
}


